DataProcessors/CRM_АРМ_ТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>CRM_АРМ_ТестДрайв</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_СтатусыТестДрайва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыТестДрайва</Name>
			<Comment>Состояния тест-драйва</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершеноДосрочно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_ЗаписьНаТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаТестДрайв</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ЗаписиНаТестДрайв</xr:Item>
				<xr:Item>InformationRegister.CRM_РезультатыКонтактов</xr:Item>
				<xr:Item>InformationRegister.CRM_ПроведенныйТестДрайв</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьНапоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаршрутыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтАнкетирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательНапоминания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестДрайва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыКомментариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПлановыеРезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/CRM_АРМ_ТестДрайв/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "АРМ Тест-драйв" + " : " + Строка(ПараметрыСеанса.Пользователь);
	Менеджер = ПолучитьТекущегоМенеджера();
	
	//заполнение диаграммы
	ДатаТД = ТекущаяДата();
	ДиаграммаТекстДрайвов.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаТекстДрайвов.ОбластьПостроения.Право = 1;
	ДиаграммаТекстДрайвов.ОбластьЗаголовка.ПрозрачныйФон = Истина;
	ДиаграммаТекстДрайвов.ОтображатьЛегенду = Ложь;
	Шкала = ДиаграммаТекстДрайвов.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Единица = ТипЕдиницыШкалыВремени.Час;
	Шкала.Формат = "ДФ=ЧЧ:мм";
	ОбновитьДанныеДиаграммы();
	
КонецПроцедуры

//Диаграмма тест-драйвов
&НаКлиенте
Процедура ДатаТДПриИзменении(Элемент)
	
	ОбновитьДанныеДиаграммы();
	УстановитьОтборТДПоДате(ДатаТД);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаТДРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДатаТД = ДатаТД + 86400 * Направление;
	ОбновитьДанныеДиаграммы();
	УстановитьОтборТДПоДате(ДатаТД);
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	
	ОбновитьДанныеДиаграммы();
	УстановитьОтборТДПоМенеджеру()
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТДПоМенеджеру()
	
	ТестДрайвы.Параметры.УстановитьЗначениеПараметра("Менеджер", Менеджер);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДрайвыПриИзменении(Элемент)
	
	ОбновитьДанныеДиаграммы()
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	
	Если НЕ Тип("Массив") = ТипЗнч(Значения) Тогда
		Авто = Неопределено;
		Если Тип("ТочкаДиаграммыГанта") = ТипЗнч(Значения) Тогда
			Авто = Значения.Значение;
		ИначеЕсли Тип("ЗначениеДиаграммыГанта") = ТипЗнч(Значения) Тогда
			Авто = Значения.Точка.Значение;
		КонецЕсли;
		ОткрытьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаДокументаУпр", Новый Структура("ДатаНачала, Автомобиль, Клиент, Менеджер, РабочийЛист, Отдел, Подразделение", Дата, Авто, ТекущийКлиент, Менеджер, ТекущийРабочийЛист, Отдел, Подразделение), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДате(Команда)
	
	Элементы.ТестДрайвыОтборПоДате.Пометка = НЕ Элементы.ТестДрайвыОтборПоДате.Пометка;
	УстановитьОтборТДПоДате(ДатаТД)
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТДПоДате(Дата)

	Период = Элементы.ТестДрайвы.Период;
	
	Период.Вариант				= ВариантСтандартногоПериода.ПроизвольныйПериод;
	Если Элементы.ТестДрайвыОтборПоДате.Пометка Тогда
		Период.ДатаНачала		= НачалоДня(Дата);
		Период.ДатаОкончания	= КонецДня(Дата);
	Иначе
		Период.ДатаНачала		= '00010101';
		Период.ДатаОкончания	= '00010101';
	КонецЕсли;
    Элементы.ТестДрайвы.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусТДПриИзменении(Элемент)
	
	УстановитьОтборПостатусу()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентТДПриИзменении(Элемент)
	
	ТестДрайвы.Параметры.УстановитьЗначениеПараметра("Наименование" , "%" + ОтборКлиентТД + "%");
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоАктивныеТД(Команда)
	
	Элементы.ТестДрайвыТолькоАктивныеТД.Пометка = НЕ Элементы.ТестДрайвыТолькоАктивныеТД.Пометка;
	УстановитьОтборПостатусу()	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСтатусу()
	
	ТолькоАктивные = Элементы.ТестДрайвыТолькоАктивныеТД.Пометка;
	Элементы.СтатусТД.ТолькоПросмотр = ТолькоАктивные;
	Если ТолькоАктивные Тогда
		Статусы = новый СписокЗначений;
		Статусы.добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыТестДрайва.Запланировано"));
		Статусы.добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыТестДрайва.Выполняется"));
		ТестДрайвы.Параметры.УстановитьЗначениеПараметра("СтатусДокумента", Статусы.ВыгрузитьЗначения());
	Иначе
		Статусы = новый СписокЗначений;
		Статусы.добавить(СтатусТД);
		ТестДрайвы.Параметры.УстановитьЗначениеПараметра("СтатусДокумента", Статусы.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменены данные автомобиля" Тогда
		ОбновитьДанныеДиаграммы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТД(Команда)
	
	ТекущийЭлемент = Элементы.ТестДрайв;
	ОткрытьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаДокументаУпр", Новый Структура("Клиент", Элементы.Клиенты.ТекущиеДанные.Ссылка, "Менеджер", Менеджер, "РабочийЛист", ТекущийРабочийЛист))
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДрайвыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ОткрытьФорму("Документ.CRM_ЗаписьНаТестДрайв.Форма.ФормаДокументаУпр", Новый Структура("ДатаНачала, Клиент, Менеджер, РабочийЛист", ДатаТД, ТекущийКлиент, Менеджер, ТекущийРабочийЛист), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокМаршрутов(Команда)
	
	ОткрытьФорму("Справочник.CRM_МаршрутыТестДрайва.Форма.ФормаСпискаУпр", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьДатуТД(Команда)
	
	ДатаТД = ДатаТД + 86400;
	УстановитьОтборТДПоДате(ДатаТД);
	ОбновитьДанныеДиаграммы();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьДатуТД(Команда)
	
	ДатаТД = ДатаТД - 86400;
	УстановитьОтборТДПоДате(ДатаТД);
	ОбновитьДанныеДиаграммы();
	
КонецПроцедуры

//******************************

&НаСервере
Процедура ОбновитьДанныеДиаграммы()
	
	ДиаграммаТекстДрайвов.Очистить();
	ДиаграммаТекстДрайвов.УстановитьПолныйИнтервал(НачалоДня(ДатаТД) + 6*60*60, КонецДня(ДатаТД));
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Авто
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|	И ЗначенияСвойствОбъектов.Значение = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияСвойствОбъектов.Объект.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	ИндексыТочек = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Точка = ДиаграммаТекстДрайвов.УстановитьТочку(Выборка.Авто);
		ИндексыТочек.Вставить(Выборка.Авто, ДиаграммаТекстДрайвов.Точки.Индекс(Точка));
	КонецЦикла;
	
	Серия = ДиаграммаТекстДрайвов.УстановитьСерию("Тест-драйв");
	
	Запрос.УстановитьПараметр("Дата", ДатаТД);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаписьНаТестДрайв.Ссылка,
	|	ЗаписьНаТестДрайв.Автомобиль,
	|	ЗаписьНаТестДрайв.Клиент,
	|	ЗаписьНаТестДрайв.Начало,
	|	ЗаписьНаТестДрайв.Продолжительность,
	|	ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность) КАК Окончание,
	|	ЗаписьНаТестДрайв.ДатаПроведения,
	|	ЗаписьНаТестДрайв.Маршрут.Наименование,
	|	ЗаписьНаТестДрайв.СтатусДокумента
	|ИЗ
	|	Документ.CRM_ЗаписьНаТестДрайв КАК ЗаписьНаТестДрайв
	|ГДЕ
	|	ЗаписьНаТестДрайв.ДатаПроведения МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ЗаписьНаТестДрайв.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Индекс = ИндексыТочек.Получить(Выборка.Автомобиль);
		Если НЕ Неопределено = Индекс Тогда
			Точка = ДиаграммаТекстДрайвов.Точки.Получить(Индекс);
			Значение = ДиаграммаТекстДрайвов.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Текст = Строка(Выборка.Ссылка) + "
			|Клиент: " + Строка(Выборка.Клиент) + "
			|Время: " + Формат(Выборка.Начало,"ДФ=ЧЧ:мм") + " - " + Формат(Выборка.Окончание,"ДФ=ЧЧ:мм") + "
			|Продолжительность: " + Строка(Выборка.Продолжительность) + " мин." + "
			|Маршрут: " + Выборка.МаршрутНаименование;
			Интервал.Начало = Выборка.ДатаПроведения + Час(Выборка.Начало)*3600 + Минута(Выборка.Начало)*60 + 120;
			Интервал.Конец = Выборка.ДатаПроведения + Час(Выборка.Окончание)*3600 + Минута(Выборка.Окончание)*60 - 120;
			Интервал.Расшифровка = Выборка.Ссылка;
			Если Выборка.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено Тогда
				Интервал.Цвет = WebЦвета.Зеленый;
			ИначеЕсли Выборка.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Отменено Тогда 
				Интервал.Цвет = WebЦвета.Серый;
			ИначеЕсли Выборка.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Выполняется Тогда 
				Интервал.Цвет = WebЦвета.Красный;
			ИначеЕсли Выборка.СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Запланировано Тогда 
				Интервал.Цвет = WebЦвета.Синий;
			Иначе
				Интервал.Цвет = WebЦвета.Зеленый;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоМенеджера()
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	ТекМенеджер = ТекПользователь.Сотрудник;
	Возврат ТекМенеджер;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборТДПоМенеджеру();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьРабочийЛист");
КонецПроцедуры
